src/InformationRegisters/ОчередьКассовогоСервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОчередьКассовогоСервера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПробития</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФискальногоЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкаПробитияЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСеансаИБ</Name>
					<Comment>Номер сеанса ИБ, в которой пробивался чек </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПробитияЧекаКассовымСервером</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>КассоваяСмена</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусыКассовойСмены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/КассовыйСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - Кассовый сервер используется
// 
// Возвращаемое значение:
//   - 
//
Функция КассовыйСерверИспользуется(Организация = Неопределено) Экспорт
	
	Возврат ЗначениеЗаполнено(ПодключаемоеОборудованиеКассовыйСервер.ИспользуемыйВСистемеКассовыйСервер(Организация));
	
КонецФункции

// Функция, получить используемый кассовый сервер и кассу.
//
Функция ПолучитьИспользуемыйКассовыйСерверИКассу(Организация) Экспорт
	
	ПолученныйКассовыйСервер = ПодключаемоеОборудованиеКассовыйСервер.ИспользуемыйВСистемеКассовыйСервер(Организация);
	
	Если ЗначениеЗаполнено(ПолученныйКассовыйСервер) Тогда
		
		ПараметрыСервера = МенеджерОборудованияВызовСервера.ПолучитьПараметрыУстройства(ПолученныйКассовыйСервер);
		Касса = ?(ПараметрыСервера <> Неопределено И ПараметрыСервера.Свойство("КассаОплаты"), ПараметрыСервера.КассаОплаты, Неопределено);
		
	КонецЕсли;
	
	Возврат Новый Структура("КассовыйСервер, Касса", ПолученныйКассовыйСервер, Касса);
	
КонецФункции

// Функция, получить используемый кассовый сервер по кассе.
//
Функция ПолучитьКассовыйСерверПоКассе(Касса) Экспорт
	
	Возврат ПодключаемоеОборудованиеКассовыйСервер.ПолучитьКассовыйСерверПоКассе(Касса);
	
КонецФункции

// Функция - Получить дату отбора из очереди кассового сервера
//
// Параметры:
//  КассаОплаты	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДатуОтбораИзОчередиКассовогоСервера(КассаОплаты) Экспорт
	
	ТекущаяКассоваяСмена = Документы.КассоваяСмена.ПолучитьСостояниеКассовойСмены(КассаОплаты);	
	Возврат ?(ТекущаяКассоваяСмена = Неопределено, НачалоДня(ТекущаяДатаСеанса()), ТекущаяКассоваяСмена.НачалоКассовойСмены);	

КонецФункции

// Функция - В текущем сеансе разрешено использвоание кассового сервера
// 
// Возвращаемое значение:
//   - 
//
Функция ВТекущемСеансеРазрешенЗапускКассовогоСервера() Экспорт
	
	ВСистемеРазрешено = КассовыйСервер.КассовыйСерверИспользуется();
	
	РабочееМесто = КассовыйСерверПовтИсп.ПолучитьРабочееМестоКассовогоСервера();
	
	Возврат ВСистемеРазрешено = Истина И ПараметрыСеанса.РабочееМестоКлиента = РабочееМесто; 
	
КонецФункции

#Область РаботаСочередью

// Процедура - Добавить документ оплаты в очередь
//
// Параметры:
//  ДокументОплаты	 - 	 - 
//
Процедура ДобавитьДокументОплатыВОчередь(ДокументОплаты) Экспорт
	
	РегистрыСведений.ОчередьКассовогоСервера.ДобавитьДокументОплатыВОчередь(ДокументОплаты);
	
КонецПроцедуры

// Процедура - Добавить массив документов оплаты в очередь
//
// Параметры:
//  МассивДокументовОплаты	 - 	 - 
//
Процедура ДобавитьМассивДокументовОплатыВОчередь(МассивДокументовОплаты) Экспорт
	
	РегистрыСведений.ОчередьКассовогоСервера.ДобавитьМассивДокументовОплатыВОчередь(МассивДокументовОплаты);
			
КонецПроцедуры

// Процедура - Записать признак успешного пробития чека
//
// Параметры:
//  ДокументОплаты		 - 	 - 
//  НомерФискальногоЧека - 	 - 
//
Процедура ЗаписатьПризнакУспешногоПробитияЧека(ДокументОплаты, НомерФискальногоЧека) Экспорт
	
	РегистрыСведений.ОчередьКассовогоСервера.ЗаписатьПризнакУспешногоПробитияЧека(ДокументОплаты, НомерФискальногоЧека);
	
КонецПроцедуры

// Процедура - Записать признак начала пробития чека для массива документов
//
// Параметры:
//  МассивДокументовОплаты	 - 	 - 
//
Процедура ЗаписатьПризнакНачалаПробитияЧекаДляМассиваДокументов(МассивДокументовОплаты) Экспорт
	
	 РегистрыСведений.ОчередьКассовогоСервера.ЗаписатьПризнакНачалаПробитияЧекаДляМассиваДокументов(МассивДокументовОплаты);
	 
КонецПроцедуры

// Процедура - Записать признак успешного пробития чека
//
// Параметры:
//  ДокументОплаты		 - 	 - 
//  НомерФискальногоЧека - 	 - 
//
Процедура ЗаписатьОшибкуПробитияЧека(ДокументОплаты, ОписаниеОшибки) Экспорт
	
	РегистрыСведений.ОчередьКассовогоСервера.ЗаписатьОшибкуПробитияЧека(ДокументОплаты, ОписаниеОшибки);
	
КонецПроцедуры

// Функция - Получить документ для оплаты из очереди
// Доработка Юля (параметр Организация)
// Возвращаемое значение:
//   - 
//
Функция ПолучитьВсеНеОплаченныеДокументИзОчередиДляТекущегоСеанса(ДатаНачалаОтбора = Неопределено, Организация = Неопределено, Касса = Неопределено) Экспорт
	
	Возврат РегистрыСведений.ОчередьКассовогоСервера.ПолучитьВсеНеОплаченныеДокументИзОчередиДляТекущегоСеанса(ДатаНачалаОтбора, Организация, Касса);
	
КонецФункции

// Функция - Количество документов в очереди
//  Доработка Юля, параметр Организация
// Параметры:
//  ДатаНачалаОтбора - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция КоличествоДокументовВОчередиДляТекущегоСеанса(ДатаНачалаОтбора = Неопределено, Касса = Неопределено) Экспорт
	
	Если НЕ Касса = Неопределено Тогда
		Организация = Касса.Организация;
	Иначе
		Организация = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация;
	КонецЕсли;
	
	// Доработка Юля, параметр Организация
	Возврат РегистрыСведений.ОчередьКассовогоСервера.КоличествоДокументовВОчередиДляТекущегоСеанса(ДатаНачалаОтбора, Организация, Касса);
	
КонецФункции

#КонецОбласти

#КонецОбласти
